lib/tasks/backfill_openstates.rake

SELECT COUNT(*) FROM "civic_bills" WHERE "civic_bills"."source" = 'openstates' AND "civic_bills"."jurisdiction" = 'pennsylvania'
SELECT "civic_bills".* FROM "civic_bills" WHERE "civic_bills"."source" = 'openstates' AND "civic_bills"."jurisdiction" = 'pennsylvania'
---
  task backfill_openstates: :environment do
    require "httparty"
    service = OpenStatesService.new
    bills   = CivicBill.where(source: "openstates", jurisdiction: "pennsylvania")
    total   = bills.count
    puts "Re-fetching #{total} OpenStates PA bills (1 request per bill, 1s delay)..."
    ok = 0; errors = 0; rate_limited = 0

    bills.each do |bill|

SELECT COUNT(*) FROM "civic_bills" WHERE "civic_bills"."source" = 'openstates' AND "civic_bills"."raw_data" IS NOT NULL
SELECT COUNT(*) FROM "civic_bills" WHERE "civic_bills"."source" = 'openstates' AND "civic_bills"."session_identifier" IS NOT NULL
---

    puts "\nDone. #{ok} refreshed, #{errors} errors, #{rate_limited} rate-limit stops."
    if ok > 0
      with_raw     = CivicBill.where(source: "openstates").where.not(raw_data: nil).count
      with_session = CivicBill.where(source: "openstates").where.not(session_identifier: nil).count