lib/tasks/fec.rake

  task import_weball: :environment do
    file_path = Rails.root.join("data", "weball26.txt")

    unless File.exist?(file_path)
      puts "ERROR: #{file_path} not found. Place weball26.txt in the data/ directory."
      exit 1
    end

    cycle_year = 2026
    imported   = 0
    skipped    = 0

    File.foreach(file_path) do |line|
      cols    = line.chomp.split("|")
      cand_id = cols[0]&.strip
      next if cand_id.blank?

      rep = CivicRepresentative.where("external_ids->>'fec_candidate_id' = ?", cand_id).first
---
SELECT "civic_representatives".* FROM "civic_representatives" WHERE (external_ids->>'fec_candidate_id' = 'H2AK00200') ORDER BY "civic_representatives"."id" ASC LIMIT 1