app/controllers/bill_comments_controller.rb

SELECT "civic_bills".* FROM "civic_bills" WHERE "civic_bills"."id" = 8 LIMIT 1
---
  def set_bill
    @bill = CivicBill.find(params[:bill_id])