app/controllers/bills_controller.rb

SELECT "civic_bills".* FROM "civic_bills" WHERE "civic_bills"."id" = 92 LIMIT 1
---
  def summary
    @bill = CivicBill.find_by(id: params[:id])

SELECT "civic_bills".* FROM "civic_bills" WHERE "civic_bills"."id" = 92 LIMIT 1
---
  def show
    @bill = CivicBill.find_by(id: params[:id])