app/controllers/dashboard_controller.rb

  def status
    job_id = params[:job_id]
    cached = Rails.cache.read("resolve:#{job_id}") ||
             ResolvedAddress.find_by(job_id: job_id)&.result_json
---
SELECT "resolved_addresses".* FROM "resolved_addresses" WHERE "resolved_addresses"."job_id" = '8cbbfe6e-39eb-4e1e-bb57-3e84afe95c59' LIMIT 1

  def result
    job_id = params[:job_id]
    cached = Rails.cache.read("resolve:#{job_id}") ||
             ResolvedAddress.find_by(job_id: job_id)&.result_json

    if cached.blank?
      redirect_to root_path, alert: "Session expired. Please search again."
      return
    end

    data = JSON.parse(cached, symbolize_names: true)

    if data[:error].present?
      redirect_to root_path, alert: "Could not resolve address. Please try again."
      return
    end

    @address       = data[:address]
    @jurisdiction  = data[:jurisdiction]
    @state_bills   = bills_from_cache(data[:state_bills])
    @federal_bills = bills_from_cache(data[:federal_bills])
    @philly_bills  = bills_from_cache(data[:philly_bills])

    date_filter      = ["status_date >= ? OR status_date IS NULL", Date.new(2025, 1, 1)]
    docket_scope     = CivicBill.active.where(date_filter).order(status_date: :desc)
    record_scope     = CivicBill.resolved.where(date_filter).order(status_date: :desc)
    @docket_total    = docket_scope.count
    @record_total    = record_scope.count
    @docket_bills    = docket_scope.limit(18).to_a
---
SELECT COUNT(*) FROM "civic_bills" WHERE (status_date >= '2025-01-01' OR status_date IS NULL)
SELECT "civic_bills".* FROM "civic_bills" WHERE (status_date >= '2025-01-01' OR status_date IS NULL) ORDER BY "civic_bills"."status_date" DESC LIMIT 18