app/controllers/officials_controller.rb

        end

        identifiers = bills.map { |b| b["_identifier"] }
        bill_id_map = CivicBill.where(identifier: identifiers).pluck(:identifier, :id).to_h
---
SELECT "civic_bills"."identifier", "civic_bills"."id" FROM "civic_bills" WHERE "civic_bills"."identifier" IN ('S. 4045', 'S. 3796', 'S. 3733', 'S. 3660', 'S. 3468')

              status_date: bill.dig("latestAction", "actionDate").then { |d| Date.parse(d) rescue nil },
              jurisdiction: "federal", created_at: now, updated_at: now }
          end
          CivicBill.upsert_all(rows, unique_by: %i[source external_id], update_only: %i[title status bill_stage status_date])
---
INSERT INTO "civic_bills" ("source","external_id","identifier","title","status","status_date","jurisdiction","created_at","updated_at") VALUES ('congress', 'S-3749', 'S. 3749', 'Expanding WKSI Eligibility Act', 'Read twice and referred to the Committee on Banking, Housing, and Urban Affairs.', '2026-01-29', 'federal', '2026-03-21 15:07:23.390430', '2026-03-21 15:07:23.390430'), ('congress', 'S-3662', 'S. 3662', 'ACCESS Act of 2026', 'Read twice and referred to the Committee on Banking, Housing, and Urban Affairs.', '2026-01-15', 'federal', '2026-03-21 15:07:23.390430', '2026-03-21 15:07:23.390430') ON CONFLICT ("source","external_id") DO UPDATE SET updated_at=(CASE WHEN ("civic_bills"."title" IS NOT DISTINCT FROM excluded."title" AND "civic_bills"."status" IS NOT DISTINCT FROM excluded."status" AND "civic_bills"."status_date" IS NOT DISTINCT FROM excluded."status_date") THEN "civic_bills".updated_at ELSE CURRENT_TIMESTAMP END),"title"=excluded."title","status"=excluded."status","status_date"=excluded."status_date" RETURNING "id"