app/models/pre_ballot.rb

SELECT COUNT(*) FROM "pre_ballots" WHERE "pre_ballots"."ward" = '1' AND "pre_ballots"."division" = '8' AND "pre_ballots"."election_slug" = 'pa_primary_20260519'
---
  def self.division_count(ward, division)
    where(ward: ward, division: division, election_slug: ELECTION_SLUG).count

SELECT COUNT(*) FROM "pre_ballots" WHERE "pre_ballots"."ward" = '1' AND "pre_ballots"."election_slug" = 'pa_primary_20260519'
---
  def self.ward_count(ward)
    where(ward: ward, election_slug: ELECTION_SLUG).count

SELECT COUNT(*) FROM "pre_ballots" WHERE "pre_ballots"."election_slug" = 'pa_primary_20260519'
---
  def self.city_count
    where(election_slug: ELECTION_SLUG).count

SELECT COUNT(*) AS "count_all", "pre_ballots"."division" AS "pre_ballots_division" FROM "pre_ballots" WHERE "pre_ballots"."ward" = '1' AND "pre_ballots"."election_slug" = 'pa_primary_20260519' GROUP BY "pre_ballots"."division"
---
  def self.ward_division_breakdown(ward)
    where(ward: ward, election_slug: ELECTION_SLUG)
      .group(:division)
      .count
      .map { |div, count| { division: div, count: count } }
      .sort_by { |r| r[:division].to_i }