app/jobs/resolve_address_job.rb

  def perform(address, job_id)
    jurisdiction = JurisdictionResolver.resolve(address)

    state_bills   = CivicBill.where(jurisdiction: "pennsylvania").order(created_at: :desc).limit(3).as_json
    federal_bills = CivicBill.where(jurisdiction: "federal").order(created_at: :desc).limit(3).as_json
    philly_bills  = CivicBill.where(jurisdiction: "philadelphia").order(created_at: :desc).limit(3).as_json
---
SELECT "civic_bills".* FROM "civic_bills" WHERE "civic_bills"."jurisdiction" = 'pennsylvania' ORDER BY "civic_bills"."created_at" DESC LIMIT 3
SELECT "civic_bills".* FROM "civic_bills" WHERE "civic_bills"."jurisdiction" = 'federal' ORDER BY "civic_bills"."created_at" DESC LIMIT 3
SELECT "civic_bills".* FROM "civic_bills" WHERE "civic_bills"."jurisdiction" = 'philadelphia' ORDER BY "civic_bills"."created_at" DESC LIMIT 3